<?php

namespace Database\Seeders;

use App\Models\Service;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class ServiceSeeder extends Seeder
{
    public function run()
    {
        $title = ['أنظمة الصوت', 'شبكات الإنترنت', 'أجهزة الكشف عن المعادن', 'أنظمة إطفاء الحريق', 'البيوت الذكية ونظام حماية الطاقة', 'السنترالات والستالايت المركزي', 'نظام الإنذار المبكر', 'نظام الحضور واإنصراف', 'كاميرات المراقبة'];
        $description = [
            '<p>نحن موفرون لخدمة انظمة الصوت المعتمدة على الموقع وتوفر تواصلاً متكاملاً وحدود البيئة التي يتم بها تقديم الخدمة.</p>

<p>المواصفات التقنية للخدمة:</p>

<ol>
	<li>تعامل مع الصوت عن بعد باستخدام الموضع الجغرافي (GPS) وتقنيات التعقب السريع.</li>
	<li>استخدام أحدث تقنيات الصوت والفيديو وتوفير خدمات استضافة عالية الجودة.</li>
	<li>توافق مع مواقع الويب وتطبيقات الجوال والتعامل مع أجهزة التشغيل وأنظمة التشغيل المختلفة.</li>
	<li>توفير حلول تأمين وأمان متكاملة وتحسين عمليات الصوت والفيديو والمحتوى الرقمي.</li>
</ol>

<p>نتطلع إلى مساعدتك ودعمك لتحقيق هذه الأهداف. إذا كانت لديك أية استفسارات أو متطلبات معينة، لا تتردد في تواصلنا لتحديد أفضل خيار لك</p>',
            '<p>تتيح خدمة شبكات الانترنت لشركة الأنظمة الماسية متابعة تحسينات أداء واستقرار الشبكات الانترنتية لعملائها.</p>

<p>تشمل ميزات خدمة شبكات الانترنت:</p>

<ol>
	<li>
	<p>تحليل أداء الشبكات: توفر ميزة تحليل أداء الشبكات تحليلًا مفصلًا لأداء الشبكات الانترنتية لعملاء الأنظمة الماسية. يمكن تحديد أسباب عدم الأداء واتخاذ إجراءات لتحسينه.</p>
	</li>
	<li>
	<p>تقارير وراء الخدمات: توفر ميزة تقارير وراء الخدمات تقاريرًا مفصلة عن أداء واستقرار الشبكات الانترنتية لعملاء الأنظمة الماسية. يمكن لمديري الشركات استخدام هذه المعلومات لتحديد الاستراتيجيات المناسبة لتحسين أداء الشبكات الانترنتية.</p>
	</li>
	<li>
	<p>دعم عملي: توفر ميزة دعم عملي دعمًا فنيًا لعملاء&nbsp;الأنظمة الماسية في تحديد مشاكل واستخدام الحلول لحل هذه المشاكل.</p>
	</li>
	<li>
	<p>متابعة وتحديث: توفر ميزة متابعة وتحديث تحديثات للبرامج والمعدات الانترنتية لضمان أداء واستقرار الشبكات الانترنتية لعملاء الأنظمة الماسية.</p>
	</li>
</ol>

<p>للاستفادة من خدمة شبكات الانترنت لشركة الأنظمة الماسية، يمكن لعملائ الشركة التسجيل والحصول على إصدار تجريبي من الخدمة. يمكن توسيع نطاق الخدمة إلى جميع عملاء الشركة عن طريق اتفاقية عملاء مدتها 6 أشهر</p>',
            '<p>تم تطوير خدمة أجهزة الكشف عن المعادن لتساعد الشركات على تحسين معدلات توليد المال.</p>

<p>هذه الخدمة تعتمد على تقنيات المعلومات وتحتاج إلى موارد قوية للعمل على تطوير موارد المعادن وتوفير أفضل تكلفة لتشغيل أي نشاط أعمال.</p>

<p>مزايا خدمة أجهزة الكشف عن المعادن:</p>

<ol>
	<li>توفير معلومات مفيدة عن موارد المعادن وتقنيات التكشف عنها.</li>
	<li>تساعد على تحديد أفضل موارد المعادن لتشغيل أي نشاط أعمال.</li>
	<li>توفر معلومات عن تكاليف تشغيل أي نشاط أعمال وتقليل التكاليف الإضافية.</li>
	<li>تساعد على تحسين معادلات أداء الأنظمة لتقليل تكاليف الكشف عن المعادن وتوفير الموارد.</li>
</ol>',
            '<p>خدمة أنظمة إطفاء الحريق هي خدمة متقدمة تتيح للمستخدمين إدارة متطلبات الأمان وتحسين معادلات أداء الأنظمة لإطفاء الحريق.</p>
<p>مزايا خدمة أنظمة إطفاء الحريق:</p>
<ol>
	<li>توفير معلومات مفيدة عن مستويات الأمان والقدرة على مواجهة حوادث الحريق.</li>
	<li>تساعد على تحديد مستويات الأمان المطلوبة لتشغيل أي نشاط أعمال.</li>
	<li>توفر معلومات عن مستويات القدرة على مواجهة حوادث الحريق والخسائر المحققة.</li>
	<li>تساعد على تحسين معادلات أداء الأنظمة لتقليل تكاليف الحريق وتوفير الموارد.</li>
</ol>',
            '<p>في عالم تتسارع فيه التكنولوجيا والتطور الصناعي والذكاء الاصطناعي كان لابد للمشاريع العقارية والشقق الحديثة أن تواكب هذا التطور والعصرنة وتسارع بإدخال الأنظمة التكنولوجية التي تسهل علينا الحياة وتبسط من وسائل الحصول على الراحة والخدمات الواسعة.
نظام المنزل الذكي SMART HOME  هو أحد أكثر الأنظمة التكنولوجيا انتشاراً في العقارات التركية وعقارات العالم خلال السنوات العشر الأخيرة لما فيه من تقنية مفيدة ومتطورة مفيدة للسكان.</p>',
            '<p>يتم تحديد الأنظمة سنترالات داخلية بشكل أساسي من خلال الترتيبات مع أزرار اختيار الخطوط الفردية لكل خط هاتف متاح. عُرفت الأنظمة الأولى باسم خطط الأسلاك وكانت تتألف ببساطة من أجهزة الهاتف والمفاتيح والمصابيح والأسلاك.</p>',
            '<p>بإمكانكم الآن المحافظة على جميع ممتلكاتكم ومنازلكم وذلك بإستخدام أجهزة إنذار ضد السرقة وفي حالة وجود أي محاولة للسرقة سيتم إشعاركم بإتصال أو برسالة عبر النظام</p>',
            '<p>يعمل النظام بتكنولوجيا بصمة الإصبع أو الوجه والتي تتيح تسجيل حضور وإنصراف الموظفين بدقة وسرعة</p>',
            '<p>تعتبر كاميرات المراقبة من أهم الوسائل التي تمكننا من متابعة ممتلكاتنا وأعمالنا بشكل مباشر عبر الهواتف الذكية من أي مكان فى العالم</p>'
        ];
        $images = ['1.jpg', '2.jpg', '3.jpg', '4.jpg', '5.jpeg', '6.png', '7.jpeg', '8.png', '9.jpg'];

        for ($s = 0; $s < count($title); $s++) {
            $service = Service::create([
                'ar' => [
                    'title' => $title[$s],
                    'description' => $description[$s]
                ],
                'status' => 1
            ]);
            $service->file()->create([
                'path' => 'seeders/services/' . $images[$s],
                'type' => 'image'
            ]);
        }
    }
}
